In [1]:
import seaborn as sns
import pandas as pd
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 500)

In [ ]:
Veri setinin yüklenmesi

In [2]:
df = sns.load_dataset("car_crashes")

In [3]:
df.columns

Index(['total', 'speeding', 'alcohol', 'not_distracted', 'no_previous', 'ins_premium', 'ins_losses', 'abbrev'], dtype='object')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   total           51 non-null     float64
 1   speeding        51 non-null     float64
 2   alcohol         51 non-null     float64
 3   not_distracted  51 non-null     float64
 4   no_previous     51 non-null     float64
 5   ins_premium     51 non-null     float64
 6   ins_losses      51 non-null     float64
 7   abbrev          51 non-null     object
dtypes: float64(7), object(1)
memory usage: 3.3+ KB

In [ ]:
# Görev 1 = List Comprehension yapısı kullanarak car_crashes verisindeki numeric değişkenlerin isimlerini büyük 
# harfe çeviriniz ve başına NUM ekleyiniz

In [5]:
["NUM_" + col.upper() if df[col].dtype != "O" else col.upper() for col in df.columns]

['NUM_TOTAL',
 'NUM_SPEEDING',
 'NUM_ALCOHOL',
 'NUM_NOT_DISTRACTED',
 'NUM_NO_PREVIOUS',
 'NUM_INS_PREMIUM',
 'NUM_INS_LOSSES',
 'ABBREV']

In [7]:
["NUM_" + col.upper() if df[col].dtype == ("float64", "int64") else col.upper() for col in df.columns]

['NUM_TOTAL',
 'NUM_SPEEDING',
 'NUM_ALCOHOL',
 'NUM_NOT_DISTRACTED',
 'NUM_NO_PREVIOUS',
 'NUM_INS_PREMIUM',
 'NUM_INS_LOSSES',
 'ABBREV']

In [ ]:
# Görev 2 = List Comprehension yapısı kullanarak car_crashes verisinde isminde "no" barındırmayan
# değişkenlerin isimlerinin sonuna "FLAG" yazınız.

In [12]:
[col.upper() + "_FLAG" if "no" not in col else col.upper() for col in df.columns]

['TOTAL_FLAG',
 'SPEEDING_FLAG',
 'ALCOHOL_FLAG',
 'NOT_DISTRACTED',
 'NO_PREVIOUS',
 'INS_PREMIUM_FLAG',
 'INS_LOSSES_FLAG',
 'ABBREV_FLAG']

In [ ]:
# Görev 3 = List Comprehension yapısı kullanarak aşağıda verilen değişken isimlerinden FARKLI olan
# değişkenlerin isimlerini seçiniz ve yeni bir dataframe oluşturunuz.
# og_list = ["abbrev", "no_previous"]

In [13]:
og_list = ["abbrev", "no_previous"]

In [14]:
new_cols = [col for col in df.columns if col not in og_list]

In [18]:
new_df = df[new_cols]

In [19]:
new_df.head()

   total  speeding  alcohol  not_distracted  ins_premium  ins_losses
0   18.8     7.332    5.640          18.048       784.55      145.08
1   18.1     7.421    4.525          16.290      1053.48      133.93
2   18.6     6.510    5.208          15.624       899.47      110.35
3   22.4     4.032    5.824          21.056       827.34      142.39
4   12.0     4.200    3.360          10.920       878.41      165.63

In [ ]:
# Görev 1: Seaborn kütüphanesi içerisinden Titanic veri setini tanımlayınız.

In [20]:
df = sns.load_dataset('titanic')

In [ ]:
# Görev 2: Titanic veri setindeki kadın ve erkek yolcuların sayısını bulunuz.

In [25]:
df.groupby('sex').agg({'sex': 'count'})

        sex
sex
female  314
male    577

In [27]:
df['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [ ]:
# Görev 3: Her bir sutuna ait unique değerlerin sayısını bulunuz.

In [30]:
df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [ ]:
# Görev 4: pclass değişkeninin unique değerlerinin sayısını bulunuz.

In [31]:
df['pclass'].unique()

array([3, 1, 2], dtype=int64)

In [ ]:
# Görev 5: pclass ve parch değişkenlerinin unique değerlerinin sayısını bulunuz.

In [37]:
df[['pclass', 'parch']].nunique()

pclass    3
parch     7
dtype: int64

In [ ]:
# Görev 6: embarked değişkeninin tipini kontrol ediniz. Tipini category olarak değiştiriniz ve tekrar kontrol ediniz.

In [43]:
df['embarked'].dtype

dtype('O')

In [44]:
df['embarked'] = df['embarked'].astype('category')

In [45]:
df['embarked'].dtype

CategoricalDtype(categories=['C', 'Q', 'S'], ordered=False)

In [ ]:
# Görev 7: embarked değeri C olanların tüm bilgelerini gösteriniz.

In [46]:
df.loc[df['embarked'] == "C"].head()

    survived  pclass     sex   age  sibsp  parch     fare embarked   class    who  adult_male deck embark_town alive  alone
1          1       1  female  38.0      1      0  71.2833        C   First  woman       False    C   Cherbourg   yes  False
9          1       2  female  14.0      1      0  30.0708        C  Second  child       False  NaN   Cherbourg   yes  False
19         1       3  female   NaN      0      0   7.2250        C   Third  woman       False  NaN   Cherbourg   yes   True
26         0       3    male   NaN      0      0   7.2250        C   Third    man        True  NaN   Cherbourg    no   True
30         0       1    male  40.0      0      0  27.7208        C   First    man        True  NaN   Cherbourg    no   True

In [ ]:
# Görev 8: embarked değeri S olmayanların tüm bilgelerini gösteriniz.

In [47]:
df.loc[df['embarked'] != "S"].head()

    survived  pclass     sex   age  sibsp  parch     fare embarked   class    who  adult_male deck embark_town alive  alone
1          1       1  female  38.0      1      0  71.2833        C   First  woman       False    C   Cherbourg   yes  False
5          0       3    male   NaN      0      0   8.4583        Q   Third    man        True  NaN  Queenstown    no   True
9          1       2  female  14.0      1      0  30.0708        C  Second  child       False  NaN   Cherbourg   yes  False
16         0       3    male   2.0      4      1  29.1250        Q   Third  child       False  NaN  Queenstown    no  False
19         1       3  female   NaN      0      0   7.2250        C   Third  woman       False  NaN   Cherbourg   yes   True

In [ ]:
# Görev 9: Yaşı 30 dan küçük ve kadın olan yolcuların tüm bilgilerini gösteriniz.

In [48]:
df.loc[(df['age'] < 30) & (df['sex'] == 'female')].head()

    survived  pclass     sex   age  sibsp  parch     fare embarked   class    who  adult_male deck  embark_town alive  alone
2          1       3  female  26.0      0      0   7.9250        S   Third  woman       False  NaN  Southampton   yes   True
8          1       3  female  27.0      0      2  11.1333        S   Third  woman       False  NaN  Southampton   yes  False
9          1       2  female  14.0      1      0  30.0708        C  Second  child       False  NaN    Cherbourg   yes  False
10         1       3  female   4.0      1      1  16.7000        S   Third  child       False    G  Southampton   yes  False
14         0       3  female  14.0      0      0   7.8542        S   Third  child       False  NaN  Southampton    no   True

In [ ]:
# Görev 10: Fare'i 500'den büyük veya yaşı 70 den büyük yolcuların bilgilerini gösteriniz.

In [49]:
df.loc[(df['fare'] > 500) | (df['age'] > 70)].head()

     survived  pclass     sex   age  sibsp  parch      fare embarked  class    who  adult_male deck  embark_town alive  alone
96          0       1    male  71.0      0      0   34.6542        C  First    man        True    A    Cherbourg    no   True
116         0       3    male  70.5      0      0    7.7500        Q  Third    man        True  NaN   Queenstown    no   True
258         1       1  female  35.0      0      0  512.3292        C  First  woman       False  NaN    Cherbourg   yes   True
493         0       1    male  71.0      0      0   49.5042        C  First    man        True  NaN    Cherbourg    no   True
630         1       1    male  80.0      0      0   30.0000        S  First    man        True    A  Southampton   yes   True

In [ ]:
# Görev 11: Her bir değişkendeki boş değerlerin toplamını bulunuz.

In [51]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
# Görev 12: who değişkenini dataframe’den çıkarınız.

In [55]:
df.drop('who', axis=1).head()

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  adult_male deck  embark_town alive  alone
0         0       3    male  22.0      1      0   7.2500        S  Third        True  NaN  Southampton    no  False
1         1       1  female  38.0      1      0  71.2833        C  First       False    C    Cherbourg   yes  False
2         1       3  female  26.0      0      0   7.9250        S  Third       False  NaN  Southampton   yes   True
3         1       1  female  35.0      1      0  53.1000        S  First       False    C  Southampton   yes  False
4         0       3    male  35.0      0      0   8.0500        S  Third        True  NaN  Southampton    no   True

In [ ]:
#  Görev 13: deck değişkenindeki boş değerleri deck değişkenin en çok tekrar eden değeri (mode) ile doldurunuz.

In [56]:
df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [57]:
type(df['deck'].mode())

pandas.core.series.Series

In [58]:
df['deck'].mode()[0]
df['deck'].fillna(df['deck'].mode()[0], inplace=True)

In [59]:
df['deck'].isnull().sum()

0

In [ ]:
# Görev 14: age değişkenindeki boş değerleri age değişkenin medyanı ile doldurunuz.

In [60]:
df['age'].median()

28.0

In [61]:
type(df['age'].median())

float

In [62]:
df['age'].fillna(df['age'].median(), inplace=True)

In [63]:
df['age'].isnull().sum()

0

In [ ]:
# Görev 15: survived değişkeninin pclass ve cinsiyet değişkenleri kırılımınında sum, count, mean değerlerini bulunuz.

In [68]:
df.groupby(['pclass', 'sex']).agg({'survived': ['sum', 'mean', 'count']})

              survived
                   sum      mean count
pclass sex
1      female       91  0.968085    94
       male         45  0.368852   122
2      female       70  0.921053    76
       male         17  0.157407   108
3      female       72  0.500000   144
       male         47  0.135447   347

In [ ]:
# Görev 16: 30 yaşın altında olanlar 1, 30'a eşit ve üstünde olanlara 0 vericek bir fonksiyon yazın.
# Yazdığınız fonksiyonu kullanarak titanik veri setinde age_flag adında bir değişken oluşturunuz. 
# (apply ve lambda yapılarını kullanınız)

In [71]:
df['age_flag'] = df['age'].apply(lambda x: 1 if x < 30 else 0)

In [72]:
df.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked  class    who  adult_male deck  embark_town alive  alone  age_flag
0         0       3    male  22.0      1      0   7.2500        S  Third    man        True    C  Southampton    no  False         1
1         1       1  female  38.0      1      0  71.2833        C  First  woman       False    C    Cherbourg   yes  False         0
2         1       3  female  26.0      0      0   7.9250        S  Third  woman       False    C  Southampton   yes   True         1
3         1       1  female  35.0      1      0  53.1000        S  First  woman       False    C  Southampton   yes  False         0
4         0       3    male  35.0      0      0   8.0500        S  Third    man        True    C  Southampton    no   True         0

In [ ]:
# Görev 17: Seaborn kütüphanesi içerisinden Tips veri setini tanımlayınız.

In [73]:
df = sns.load_dataset('tips')

In [76]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
# Görev 18: Time değişkeninin kategorilerine (Dinner, Lunch) göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.

In [77]:
df.groupby('time').agg({'total_bill': ['sum', 'min', 'max', 'mean']})

       total_bill
              sum   min    max       mean
time
Lunch     1167.47  7.51  43.11  17.168676
Dinner    3660.30  3.07  50.81  20.797159

In [ ]:
# Görev 19: Günlere ve time'a göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.

In [78]:
df.groupby(['time', 'day']).agg({'total_bill': ['sum', 'min', 'max', 'mean']})

            total_bill
                   sum    min    max       mean
time   day
Lunch  Thur    1077.55   7.51  43.11  17.664754
       Fri       89.92   8.58  16.27  12.845714
       Sat        0.00    NaN    NaN        NaN
       Sun        0.00    NaN    NaN        NaN
Dinner Thur      18.78  18.78  18.78  18.780000
       Fri      235.96   5.75  40.17  19.663333
       Sat     1778.40   3.07  50.81  20.441379
       Sun     1627.16   7.25  48.17  21.410000

In [ ]:
# Görev 20: Lunch zamanına ve kadın müşterilere ait total_bill ve tip değerlerinin day'e göre toplamını, min, max ve ortalamasını bulunuz.

In [81]:
df[(df['time'] == 'Lunch') & (df['sex'] == 'Female')].groupby('day').agg({'total_bill': ['sum', 'min', 'max', 'mean'],
                                                                          'tip': ['sum', 'min', 'max', 'mean']})

     total_bill                            tip
            sum    min    max      mean    sum   min   max      mean
day
Thur     516.11   8.35  43.11  16.64871  79.42  1.25  5.17  2.561935
Fri       55.76  10.09  16.27  13.94000  10.98  2.00  3.48  2.745000
Sat        0.00    NaN    NaN       NaN   0.00   NaN   NaN       NaN
Sun        0.00    NaN    NaN       NaN   0.00   NaN   NaN       NaN

In [ ]:
# Görev 21: size'i 3'ten küçük, total_bill'i 10'dan büyük olan siparişlerin ortalaması nedir? (loc kullanınız)

In [85]:
df.loc[(df['size'] < 3 ) & (df['total_bill'] > 10), 'total_bill'].mean()

17.184965034965035

In [ ]:
# Görev 22: total_bill_tip_sum adında yeni bir değişken oluşturunuz. Her bir müşterinin ödediği totalbill ve tip in toplamını versin.

In [92]:
df['total_bill_tip_sum'] = df['total_bill'] + df['tip']

In [93]:
df.head()

   total_bill   tip     sex smoker  day    time  size  total_bill_tip_sum
0       16.99  1.01  Female     No  Sun  Dinner     2               18.00
1       10.34  1.66    Male     No  Sun  Dinner     3               12.00
2       21.01  3.50    Male     No  Sun  Dinner     3               24.51
3       23.68  3.31    Male     No  Sun  Dinner     2               26.99
4       24.59  3.61  Female     No  Sun  Dinner     4               28.20

In [ ]:
# Görev 23: total_bill_tip_sum değişkenine göre büyükten küçüğe sıralayınız ve ilk 30 kişiyi yeni bir dataframe'e atayınız.

In [94]:
new_df = df.sort_values('total_bill_tip_sum', ascending=False)[:30]

In [95]:
new_df.shape

(30, 8)

In [96]:
new_df.head()

     total_bill    tip   sex smoker  day    time  size  total_bill_tip_sum
170       50.81  10.00  Male    Yes  Sat  Dinner     3               60.81
212       48.33   9.00  Male     No  Sat  Dinner     4               57.33
59        48.27   6.73  Male     No  Sat  Dinner     4               55.00
156       48.17   5.00  Male     No  Sun  Dinner     6               53.17
182       45.35   3.50  Male    Yes  Sun  Dinner     3               48.85